package 배열3_문제;

/*
	[문제]
		아래 그림을 참고해 배열을 생성하한다.
		2인용 게임으로 서로 번갈아가며 주사위를 던진다.(입력받거나 랜덤으로)
		주사위의 숫자만큼 이동하여, 3바퀴를 먼저 돌면 
		승리하는 게임이다.
		단, 이동할 때 외곽으로만 이동할 수 있다.
	
		p1 = 0[0바퀴]
		p2 = 0[0바퀴]
		*    □    □    □    □ 
		□    ■    ■    ■    □ 
		□    ■    ■    ■    □ 
		□    ■    ■    ■    □ 
		□    □    □    □    □ 
		
		[p1]차례 주사위 입력(1 ~ 6) : 3
		p1 = 3[0바퀴]
		p2 = 0[0바퀴]
		홋    □    □    솟    □ 
		□    ■    ■    ■    □ 
		□    ■    ■    ■    □ 
		□    ■    ■    ■    □ 
		□    □    □    □    □ 
		
		[p2]차례 주사위 입력(1 ~ 6) : 5
		p1 = 3[0바퀴]
		p2 = 5[0바퀴]
		□    □    □    솟    □ 
		□    ■    ■    ■    홋 
		□    ■    ■    ■    □ 
		□    ■    ■    ■    □ 
		□    □    □    □    □ 
		
		[p1]차례 주사위 입력(1 ~ 6) : 2
		p1 = 5[0바퀴]
		p2 = 5[0바퀴]
		□    □    □    □    □ 
		□    ■    ■    ■    * 
		□    ■    ■    ■    □ 
		□    ■    ■    ■    □ 
		□    □    □    □    □ 
		
		[p2]차례 주사위 입력(1 ~ 6) : 3
		p1 = 5[0바퀴]
		p2 = 8[0바퀴]
		□    □    □    □    □ 
		□    ■    ■    ■    솟 
		□    ■    ■    ■    □ 
		□    ■    ■    ■    □ 
		□    □    □    □    홋
*/

public class 배열3_문제06_모두의마블_문제 {
	public static void main(String[] args) {
		
		
	}
}
