package 배열9_문제;

import java.util.Arrays;

/*
	[문제]
		1. input의 데이터를 a배열에 순차적으로 저장한다.
		2. 단, 저장하려는 숫자가 현재 숫자와 같으면 둘 다 삭제한다.
	
			a = {1, 3, 0, 0, 0, 0, 0, 0, 0, 0}
			a = {1, 0, 0, 0, 0, 0, 0, 0, 0, 0}
			a = {1, 2, 0, 0, 0, 0, 0, 0, 0, 0}
			a = {1, 2, 1, 0, 0, 0, 0, 0, 0, 0}
			a = {1, 2, 0, 0, 0, 0, 0, 0, 0, 0}
			a = {1, 2, 4, 0, 0, 0, 0, 0, 0, 0}
			a = {1, 2, 0, 0, 0, 0, 0, 0, 0, 0}
	[정답]
		a = {1, 2, 0, 0, 0, 0, 0, 0, 0, 0}
*/

public class 배열9_문제01_같은수삭제_문제 {
	public static void main(String[] args) {
		
		int[] input = {1, 3, 3, 2, 1, 1, 4, 4};
		int[] a = new int[input.length];
		
		
	}
}
